[{"id":1,"title":"How to be the light?","content":"In one of our online meetings last month, I shared about how should we, Christians, live out our faith in this world in our daily lives. Matthew 5:14-16 tells us what our Lord Jesus Christ said:\n\n\"You are the light of the world. A city set on a hill cannot be hidden. Nor do people light a lamp and put it under a basket, but on a stand, and it gives light to all in the house. In the same way, let your light shine before others, so that they may see your good works and give glory to your Father who is in heaven.\"\nOne of the girls shared their thoughts: “I’m not sure if I’ve become the light, there were times when I was tempted to not be one,” and another one, “I don’t know if I give enough impact that I can be called the light.” Do you find those thoughts familiar? How can we be the light?\n\n1. Connect to the source\nMatthew 5 is the teaching of Jesus to His disciples and the crowd that followed Him. Do you notice something? Jesus did not say, “Be the light of the world” He said, “You are the light of the world.” It is not a request, it is a statement. Jesus did not ask His disciples to be someone they are not, He stated the identity of His followers.\n\nYou are the light of the world.\nA city set on a hill cannot be hidden.\n\nMatthew 5:14 (ESV)\n“But how?” we may ask. In another teaching noted in John 8:12, Jesus said, “I am the light of the world. Whoever follows Me, will not walk in darkness, but will have the light of life.” Whoever follows Jesus will have the light of life. In other words, if we do not follow Jesus, we have no light in us. We are the light of the world if we follow the true Light of the world.\n\nSin entered the world through the disobedience of one man, Adam. But by the grace of God, God Himself came in human form and obeyed to the point of death, showing us that it is possible to obey; Jesus was the living example of obedience to the word of God. Read His words and do it the way Jesus did.\n\n“If anyone would come after me, let him deny himself and take up his cross daily and follow me.”\n\nLuke 9:23 (ESV)\nDon’t you agree that we do not have the power to shine on our own? I give you the example of my table lamp, it doesn’t have to worry whether it will lighten the room or not, its shine just brightens my workspace when I connect it to the power. In the same way, I don’t have to worry about how my action or words will lighten the world around me, connect to the power of Jesus’ love and we will shine. Connect our mind to His words, connect our words to His teaching, connect our action to His example of obedience, and by then we will shine in the light of God’s glory, and lighten the space God puts us in.\n\n2. Walk together\nYou are never alone. Not only with Jesus, but following Him gives us company with one another as children of light. There are many children of the Lord and someday we‘ll gather together on the day when Jesus comes. You and I may not know each other in person, but we meet in the prayers to the same Father, hold the same words of His Spirit, and live in the same faith in Jesus’ life and resurrection. Children of light walk in God’s goodness and righteousness, we are in companionship with each other to do what is pleasing to God.\n\nFor at one time you were darkness, but now you are light in the world. Walk as children of light.\n\nEphesians 5:8 (ESV)\nBrothers and sisters, let us find the opportunity to be in the fellowship with the believers. Even when you can’t get one in your neighborhood, online friendship works too! Start to hold each other with prayers, pray for me as I also pray for you. Pray for the other believers in your area, in your city, in your state, in your country, and beyond. Many of them need to walk alone in their faith, but they are not lonely because you are also praying for and with them. Study the Bible together, and find what is true, because not every Christian-related post on the internet is true. I once gave my disagreement with a Christian blogger about what she posted, but we are good. She understood my point and I understood hers, we complete each other and walk together as children of light.\n\nWe live in this world but are not a part of it. We walk on this earth, yet do not follow its path. How should we spend our days here, then? By following Christ, the true light, holding fast to Him so we could shine as light in the world. May the Lord bless you!\n\n","tags":[{"title":"bottom-line","description":"Curabitur at ipsum ac tellus semper interdum."},{"title":"mobile","description":"Ut tellus. Nulla ut erat id mauris vulputate elementum. Nullam varius. Nulla facilisi. Cras non velit nec nisi vulputate nonummy."},{"title":"protocol","description":"Duis ac nibh. Fusce lacus purus, aliquet at, feugiat non, pretium quis, lectus."}],"image_url":"http://dummyimage.com/123x100.png/cc0000/ffffff"},
{"id":2,"title":"The Calling for Christians","content":"“We all are called to experience God.” This was somehow appeared in my head around three years ago in my final year in the seminary. I was not sure what that mean, but I was sure enough that was what God wanted me to reflect on approaching the end of my four-year study. Three years later, not remembering what I had written, the Lord guides me to prepare teaching material from 1 John 1:1-3.\n\nThat which was from the beginning, which we have heard, which we have seen with our eyes, which we have looked at and our hands have touched—this we proclaim concerning the Word of life. The life appeared; we have seen it and testify to it, and we proclaim to you the eternal life, which was with the Father and has appeared to us. We proclaim to you what we have seen and heard, so that you also may have fellowship with us. And our fellowship is with the Father and with His Son, Jesus Christ.\n\n1 John 1:1-3 (NIV)\nAre you familiar with the ice-breaking game “Two Truths and a Tale”? The game goes with each person in the group taking a turns to tell three things about themselves, then the rest of the team would guess which of the three is a tale. Unless you were a pro, telling others about the things you’ve experienced or the truth about yourself is way easier rather than making up something fake. By playing this game, the group members would usually get to know each other better or have some fun listening to each other’s facts. Shouldn’t sharing about Jesus be that fun too?\n\nApostle John begins his letter with an assertion that “this I have experienced it myself,” making it clear to the readers that the three-letter of John was not made up of tales or little bird’s singing, but from personal life experience.\n\nWe all know that the calling for all believers is to “Go, Preach, and Teach.” Indeed, the command we call the Great Commission is for those who follow Jesus, not only for pastors or missionaries. How do we preach and teach if we do not know what it is that Jesus says? Like what the Apostle John has shared with us, thus we are called to have a fellowship with God and then we could share what we have.\n\nThe reason for John’s testimony is “So that you also may have fellowship with us. And our fellowship is with the Father and with His Son, Jesus Christ.” A bell rings in my head as I’m reading that part. Do you remember in the account of creation, the LORD God said, “Let us make man in our image, after our likeness” (v26) and “So God created man in his own image, in the image of God he created him; male and female he created them” (v27)? Could you see that? To be in fellowship with our Creator is one of the traits “in the image of God.” There is an eternal fellowship within the Trinity and man was created to be in that fellowship too; with one another and with God, just like Adam, Eve, and God. The fellowship was broken as the consequence of man’s sin, but Jesus came to mend that brokenness so we who believe in Him would have the fellowship with one another and with God the Father, Son, and the Holy Spirit.\n\nBrothers and sisters, as the weekdays start today, let us strive in our fellowship with one another, live in God’s words by doing it. So that like John the apostle, we would hear, see, touch it comes alive in our lives, and then we could, in joy, share to the world the experience we have about the living word of God, Jesus Christ.\n\nHave a wonderful week and may God bless you!","tags":[{"title":"website","description":"Aliquam erat volutpat. In congue. Etiam justo. Etiam pretium iaculis justo."},{"title":"strategy","description":"Morbi sem mauris, laoreet ut, rhoncus aliquet, pulvinar sed, nisl. Nunc rhoncus dui vel sem. Sed sagittis. Nam congue, risus semper porta volutpat, quam pede lobortis ligula, sit amet eleifend pede libero quis orci. Nullam molestie nibh in lectus. Pellentesque at nulla. Suspendisse potenti."},{"title":"Seamless","description":"Ut at dolor quis odio consequat varius. Integer ac leo. Pellentesque ultrices mattis odio. Donec vitae nisi. Nam ultrices, libero non mattis pulvinar, nulla pede ullamcorper augue, a suscipit nulla elit ac nulla. Sed vel enim sit amet nunc viverra dapibus. Nulla suscipit ligula in lacus. Curabitur at ipsum ac tellus semper interdum. Mauris ullamcorper purus sit amet nulla. Quisque arcu libero, rutrum ac, lobortis vel, dapibus at, diam."}],"image_url":"http://dummyimage.com/163x100.png/5fa2dd/ffffff"},
{"id":3,"title":"The Loving God: what it is all about?","content":"So God created man in His own image,\nin the image of God He created him;\nmale and female He created them.\n\nGenesis 1:27 (ESV)\nIsn’t it amazing to see how the Lord has made man and woman in His image? He breathed His breath into them, making man in His likeness so that they could have a relationship with Him. The Lord clothed them in His glory and holiness, enabling them to do His purpose on the earth He has created.\n\n“And behold, it was very good!”\nGod put man and his wife in such a perfect place like Eden and gave them nice and healthy fruits for daily meals. Imagine having fresh papaya and apple for breakfast, durian and mango for lunch (such a South-East Asian dream!), grapes, peaches, and kiwi for dinner, you mention it! It all sounds perfect! The first task mentioned in the Bible of what Adam should do sounds so fun too: giving names to all kinds of birds and animals on earth! Names to the cute little kittens and the fluffy bears, to the mighty elephants and the tall giraffes, to the soft little lambs and the strong goats, to the noisy crickets and the loud tigers! Everything seems so perfect! I’m sure the animals loved Adam too, they must be very happy and gave their mischievous smiles when the Lord finally made Adam a human friend, hehe!\n\n“And God saw everything that He had made, and behold, it was very good. And there was evening and there was morning, the sixth day.”\n\nGenesis 1:31 (ESV)\nWe don’t know how long it had been for Adam and Eve to enjoy the garden of Eden; having nice walks in the garden with their Creator, and perfect friendship with other creatures. But one day, it all changed.\n\n“Because you have done this”\nAdam was there when Eve had a chat with the snake, and we don’t find him feeling bothered. Did the Lord make animals smarter than man? Could mammals talk with human language? Was it normal for mankind to converse with them? Well, no mention of that in the Bible. But we know how the serpent lured Eve to take from the forbidden tree, the Tree of the Knowledge of Good and Evil.\n\nYou may surely eat of every tree of the garden, but the tree of the knowledge of good and evil you shall not eat, for in the day that you eat of it you shall surely die.\n\nGenesis 2:16-17 (ESV)\nAdam seemed cool with Eve’s conversation, her taking the fruit and eating it. He didn’t move a bit to stop his wife from taking from the tree the Lord commanded them not to take. He also took the fruit his wife gave and ate it. From all the perfect things the Lord had given for free and abundantly to them, they chose the one the Lord didn’t give. The earth turned dark, Adam and Even had torn their splendid clothes: the glory of God. Their eyes were opened and they came to realize that they had nothing on them.\n\nThe Lord saw everything Adam and Eve did, yet He didn’t interrupt. He wanted them to be satisfied with all the best things He had provided, but they didn’t. He wanted them to remember His loving words, but they didn’t. He wanted them to choose Him, but they didn’t. Still, He came and look for them, gave His ears to their words.\n\nThe peaceful garden was now shaken, sin had brought death to its curse. Not because God is not a loving Creator, but because man had chosen their destiny. The consequence of their disobedience is death, God had said it and it must happen. The word of the Lord is forever and He is faithful to His promise, if He doesn’t, He is not God. But we see, clothes from animal’s skin He gave to them, blood has been shed, and we know some animals had taken their place to die; all because man had sinned.\n\nThe Promise of Hope\nAnd the LORD God made for Adam and for his wife garments of skins and clothed them.\n\nGenesis 3:21 (ESV)\nIt was a difficult day for the whole creation, all eyes were wide open in fear, and loud heartbeats must be heard. The land was cursed, the animals lost their kin, and man’s sin had separated them from God. But nothing is difficult for the Creator. The loving Father of all never lost His way to save. The promise of salvation He made, and the first act He did was to put the man and his wife away from the tree of life. The Lord didn’t want the man He created to live eternally in their sin.\n\nAnd that was the reason that made Jesus come. First Corinthians 15:21-22 says, “For since death came through a man, the resurrection of the dead comes also through a man. For as in Adam all die, so in Christ all will be made alive.” The promise of hope has been fulfilled, death has lost its sting, and the cross of Christ is our reminder of what it’s all about: God’s love for all He has created.","tags":[{"title":"productivity","description":"Nulla justo. Aliquam quis turpis eget elit sodales scelerisque. Mauris sit amet eros. Suspendisse accumsan tortor quis turpis. Sed ante."}],"image_url":"http://dummyimage.com/172x100.png/5fa2dd/ffffff"}]